---
title: "式と頭部"
draft: true
---

Wolfram 言語では，データを **式** という概念で扱います．  
式には **変数** と **関数** の $2$ 種類あります．

また，式には **頭部** という情報が与えられています．

# 組み込みの式

Mathematica には組み込みで様々な式が定義されています．

それぞれの式の名前にはアッパーキャメルケース（先頭大文字・単語を大文字で区切る）が用いられています．

## 変数

例として円周率 $\pi$ をみてみます．  
Mathematica では Pi として定義されています．

~~~code:builtin.nb
In[1]:= Pi
Out[1]= π
~~~

円周率 π など有名な定数は出力の際に見やすくしてくれます．  
これをそのまま打つこともできます．

~~~code:builtin.nb
In[2]:= π
Out[2]= π
~~~

Wolfram 言語は数式をそのまま処理してくれるので，そのままでは近似値にならず厳密な計算ができます．

## 関数

関数は括弧 [] を使って呼び出します．数学や他言語では () が多い中，独特ですね．

たとえば，近似値を求めるには関数 N が用意されています．

~~~code:builtin.nb
In[3]:= N[Pi]
Out[3]= 3.14159

In[4]:= N[π]
Out[4]= 3.14159
~~~

引数をまったくもっていなかったり複数個もっている関数も考えられます．

たとえば，N ではふたつめの引数を与えることで任意の精度で計算させることができます．

~~~code:builtin.nb
In[5]:= N[Pi, 16]
Out[5]= 3.141592653589793
~~~

ちなみに精度を指定しないときの精度は実行環境依存です．  

# 自作の式

自分で式を定義することもできます．

自分で定義する式の名前にはローワーキャメルケース（先頭小文字・単語を大文字で区切る）を用いることが推奨されています．

## 変数

変数は以下のように定義します．

~~~code:custom.nb
In[1]:= a = 1
Out[1]= 1
~~~

代入するときにも同じ構文を使います．

~~~code:custom.nb
In[2]:= a = 2
Out[2]= 2
~~~

## 関数

関数を定義するときには [] を使います．

~~~code:custom.nb
In[3]:= f[] = -1
Out[3]= -1

In[4]:= f[]
Out[4]= -1
~~~

関数は引数を与えることができます．  
引数はアンダースコアを付加し [] の中に書きます．

~~~code:custom.nb
In[5]:= g[x_] = 2x
Out[5]= 2x

In[6]:= g[-2]
Out[6]= -4
~~~

引数はそのままだとすべての頭部を受け付けます．  
アンダースコアの後ろに頭部を書くことで，頭部を指定することができます．

~~~code:custom.nb
In[7]:= h[x_Integer] = 3x
Out[7]= 3x

In[8]:= h[4]
Out[8]= 12

In[9]:= h[1.2]
Out[9]= h[1.2]
~~~

頭部が合わない値を引数に与えると特に計算されずそのまま返ってきます．

# 定数

Protected・Unprotected 関数で代入を禁止・許可できます．

~~~code:protect.nb
In[1]:= a = 1
Out[1]= 1

In[2]:= Protect[a]
Out[2]= {a}

In[3]:= a = 2
  Set: シンボルaはProtectedです．
Out[3]= 2

In[4]:= a
Out[4]= 1
~~~

組み込みの式は最初から Protected になっています．

~~~code:protect.nb
In[5]:= Pi = 3
  Set: シンボルπはProtectedです．
Out[5]= 3

In[6]:= Pi
Out[6]= π

In[7]:= Unprotected[Pi]
Out[7]= {Pi}

In[8]:= Pi
Out[8]= 3
~~~

代入に失敗しても失敗した値が返ってきます．
